cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'blackfireio/homebrew-blackfire'
tap 'homebrew/cask-fonts'

brew 'coreutils'
brew 'ack'
brew 'go'
brew 'grc'
brew 'node'
brew 'readline'
brew 'wget'
brew 'nmap'
brew 'youtube-dl'
brew 'tree'
brew 'php@7.4'
brew 'composer'
brew 'watchman'
brew 'blackfire-agent'
brew 'ansible'
brew 'hub'
brew 'fd'
brew 'bat'
brew 'pkg-config'
brew 'imagemagick'
brew 'ruby'
brew 'fastlane'

cask 'transmission'
cask 'hyper'
cask '1password'
cask 'bettertouchtool'
cask 'karabiner-elements'
cask 'spotify'
cask 'sublime-text'
cask 'steam'
cask 'phpstorm'
cask 'the-unarchiver'
cask 'teamviewer'
cask 'google-chrome'
cask 'font-fira-code'
cask 'sequel-pro'
cask 'android-platform-tools'
cask 'insomnia'
cask 'brave-browser'
cask 'ngrok'
cask 'cyberduck'
cask 'slack'