cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'blackfireio/homebrew-blackfire'
tap 'caskroom/fonts'

brew 'coreutils'
brew 'ack'
brew 'go'
brew 'grc'
brew 'node'
brew 'readline'
brew 'wget'
brew 'yarn'
brew 'nmap'
brew 'youtube-dl'
brew 'tree'
brew 'php@7.2'
brew 'composer'
brew 'watchman'
brew 'blackfire-agent'
brew 'ansible'
brew 'hub'
brew 'fd'
brew 'bat'
brew 'pkg-config'

cask 'transmission'
cask 'hyper'
cask '1password'
cask 'bettertouchtool'
cask 'karabiner-elements'
cask 'spotify'
cask 'sublime-text'
cask 'steam'
cask 'phpstorm'
cask 'querious'
cask 'the-unarchiver'
cask 'teamviewer'
cask 'mplayerx'
cask 'sip'
cask 'google-chrome'
cask 'aerial'
cask 'font-fira-code'
cask 'sequel-pro'

# Quick look plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
